# RasterSymbolPixelwidth Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RasterSymbolPixelwidth Property
ParameterTypeId Class See Also
---
"Width (pixels)"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RasterSymbolPixelwidth { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RasterSymbolPixelwidth As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RasterSymbolPixelwidth {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace